Revit 2024 API
LightGroup.Id Property
 The ElementId of the LightGroup
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId Id { get; }
Visual Basic
Public ReadOnly Property Id As ElementId
	Get
Visual C++
public:
property ElementId^ Id {
	ElementId^ get ();
}
See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace